zup/ЗУП_бюджет/src/InformationRegisters/НастройкиГосударственнойСлужбы/НастройкиГосударственнойСлужбы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиГосударственнойСлужбы</name>
  <resources>
    <name>ИспользоватьРасчетДенежногоДовольствияВоеннослужащих</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИспользоватьРасчетДенежногоДовольствияВоеннослужащихПоПризыву</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>РазрешеноСовместительствоВоеннослужащимПоКонтракту</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИспользоватьРасчетДенежногоСодержанияПрокуроров</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПремияЗаДВСОРассчитываетсяПоОкладуНаНачалоМесяца</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>НеИспользоватьРасчетДенежногоДовольствияВоеннослужащих</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИспользоватьГосударственныеМуниципальныеДолжности</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИспользоватьРасчетДенежногоСодержанияСудей</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИспользоватьСохраняемоеДенежноеСодержаниеДолжностейГражданскойСлужбы</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИспользоватьСохраняемоеДенежноеСодержаниеДолжностейГосударственнойСлужбы</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИспользоватьСохраняемоеДенежноеСодержаниеСудей</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВыбиратьВариантРасчетаСреднего</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
</mdclass:InformationRegister>

zup/ЗУП_бюджет/src/InformationRegisters/НастройкиГосударственнойСлужбы/RecordSetModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтотОбъект.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
		
	Если ЭтотОбъект[0].ИспользоватьРасчетДенежногоДовольствияВоеннослужащих Тогда
		ЭтотОбъект[0].РазрешеноСовместительствоВоеннослужащимПоКонтракту = Ложь;
	Иначе
		ЭтотОбъект[0].ИспользоватьРасчетДенежногоДовольствияВоеннослужащихПоПризыву = Ложь;
	КонецЕсли;
	
	ЭтотОбъект[0].НеИспользоватьРасчетДенежногоДовольствияВоеннослужащих = Не ЭтотОбъект[0].ИспользоватьРасчетДенежногоДовольствияВоеннослужащих;
	
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)
	
	РасчетДенежногоДовольствия.УстановитьЗависимыеНастройкиИспользоватьРасчетДенежногоДовольствияВоеннослужащих(ЭтотОбъект, Отказ);
	РасчетДенежногоСодержания.УстановитьНастройкуИспользоватьРасчетСохраняемогоДенежногоСодержания(ЭтотОбъект);
	
	// Подключаемые Характеристики
	ИсточникиХарактеристик = Новый Массив;
	ИсточникиХарактеристик.Добавить("СвойстваДолжностейГосударственнойСлужбы");
	ИсточникиХарактеристик.Добавить("СвойстваНачисленийГосударственныхСлужащих");
	ИсточникиХарактеристик.Добавить("СтрокиОтчетностиРасходовИЧисленностиРаботниковГосударственныхОрганов");
	ПодключаемыеХарактеристикиЗарплатаКадры.ОбновитьНаборыПодключаемыхХарактеристик(Истина, ИсточникиХарактеристик);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
